// Прочитайте главу 4 книги Роберта Мартина «Чистый код».
// Выпишите ниже рекомендации по употреблению комментариев в коде.
//
// Рекомендации:
// Коментарии помогают понять более сложный код или алгоритмы.
// Коментарии не нужно оставлять для объяснения очевидного и простых вещей.
// Коментраии не нужно оставлять после каждой строки или каждого слова. Это засоряет код программы и мешает его пониманию.
// Нужно грамотно и понятно оставлять коментарии, что бы читающие могли его понять.
// Если поменяли код, то не забудьте проверить коментарии к нему. Иначе они могут только запутать читателей.
#include <iostream>

int main() {
    std::cout << "There is no useful output. Read comments" << std::endl;
    return 0;
}
